In [ ]:
# Definition=
# As long as more than one columns of an exel sheet, then it is called data sheet

## Import

In [2]:
import numpy as np # numpy same as np
import pandas as pd # pandas same as pd

# Creating a Dataframe

In [4]:
mydata = np.random.randint(0,101,(4,3))#4x3||4 is row 3 is column
my_index = ['CA','NY','AZ','TX']
my_col = ['Jan','Feb','Mar'] # col is column for short
df=pd.DataFrame(data=mydata,index=my_index,columns=my_col)#df is dataframe
df

    Jan  Feb  Mar
CA   53   69   68
NY   60   20   18
AZ   12   45   66
TX   76   71   51

# Read .csv file

In [ ]:
df = pd.read_csv('tips.csv')
df
# a smart display system that displays the first 5 and last 5 lines as some 
# files can have millions and could be way to long
# FOR COLUMNS there are 11 different features/data including the column is 12
# FOR ROWS not including title row is 244

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

### Assingment 1. import read .csv file(basketball file) 2. Explain a details of features everysingle one. 3. Comepeup with an idea of a description of the dataset(objective truth no sujective truth) 4. According to the basketball datasets... Propose a study on at least 2 topics you can research

# DataFrames

## Obtaining Basic Information About DataFrame

In [6]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [ ]:
df.head(3)#this will print the first numbers. On default without any numbers
#e.g.(3) it will print the first 5

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458

In [9]:
df.tail(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [ ]:
len(df)  # This gives the number of rows

244

In [ ]:
len(df.columns) # This prints the number of columns

11

# Selction and Indexing

In [13]:
# Grab a single column

### Grab a single column

In [14]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [15]:
df['sex']

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: object

In [ ]:
df['total_bill'].head(9) # combines the two together

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
6     8.77
7    26.88
8    15.04
Name: total_bill, dtype: float64

In [20]:
type(df['total_bill'])

pandas.core.series.Series

### Grab Multiple Columns

In [ ]:
# Note how its a python list of column names!  Thus the double brackets.
df[['total_bill','tip','sex']]

     total_bill   tip     sex
0         16.99  1.01  Female
1         10.34  1.66    Male
2         21.01  3.50    Male
3         23.68  3.31    Male
4         24.59  3.61  Female
..          ...   ...     ...
239       29.03  5.92    Male
240       27.18  2.00  Female
241       22.67  2.00    Male
242       17.82  1.75    Male
243       18.78  3.00  Female

[244 rows x 3 columns]